app/controllers/apps_controller.rb

  def show
    @app = @current_developer.apps.find_by_id(params[:id])
---
SELECT `apps`.* FROM `apps` INNER JOIN `app_developers` ON `apps`.id = `app_developers`.app_id WHERE (`apps`.`id` = 6) AND ((`app_developers`.developer_id = 1)) LIMIT 1

  def edit
    @app = @current_developer.apps.find_by_id(params[:id])
---
SELECT `apps`.* FROM `apps` INNER JOIN `app_developers` ON `apps`.id = `app_developers`.app_id WHERE (`apps`.`id` = '1') AND ((`app_developers`.developer_id = 1)) LIMIT 1

  def create
    @app = App.new(params[:app])

    if @app.save and @current_developer.apps << @app
---
INSERT INTO `app_developers` (`app_id`, `developer_id`) VALUES(1, 1)
INSERT INTO `apps` (`name`, `updated_at`, `url`, `secret_key`, `is_active`, `description`, `created_at`) VALUES('Test app1', '2009-09-21 20:29:01', 'www.google.com', '', 0, 'testing', '2009-09-21 20:29:01')

  def update
    @app = @current_developer.apps.find_by_id(params[:id])
    return if app_not_found(@app)

    if @app.update_attributes(params[:app])
---
SELECT * FROM `apps` WHERE (`apps`.`id` = 2)
UPDATE `apps` SET `description` = 'Best articles on the web', `updated_at` = '2009-09-21 20:52:10', `url` = 'www.jurnalo.com', `name` = 'Jurnalo' WHERE `id` = 2

  def reset_secret_key
    @app = @current_developer.apps.find_by_id(params[:id])
    return if app_not_found(@app)
    @app.reset_secret_key

    if @app.save
---
SELECT `apps`.* FROM `apps` INNER JOIN `app_developers` ON `apps`.id = `app_developers`.app_id WHERE (`apps`.`id` = 2 AND ((`app_developers`.developer_id = 1)))
UPDATE `apps` SET `secret_key` = 'emcmlwlr', `updated_at` = '2009-09-21 21:30:20' WHERE `id` = 2

  def activate
    @app = @current_developer.apps.find_by_id(params[:id])
    return if app_not_found(@app)
    @app.is_active = true
    if @app.save
---
SELECT `apps`.* FROM `apps` INNER JOIN `app_developers` ON `apps`.id = `app_developers`.app_id WHERE (`apps`.`id` = '4') AND ((`app_developers`.developer_id = 1)) LIMIT 1
UPDATE `apps` SET `is_active` = 1, `updated_at` = '2009-09-21 21:23:26' WHERE `id` = 2

  def deactivate
    @app = @current_developer.apps.find_by_id(params[:id])
    return if app_not_found(@app)
    @app.is_active = false
    if @app.save
---
SELECT `apps`.* FROM `apps` INNER JOIN `app_developers` ON `apps`.id = `app_developers`.app_id WHERE (`apps`.`id` = 3 AND ((`app_developers`.developer_id = 1)))
UPDATE `apps` SET `is_active` = 0, `updated_at` = '2009-09-21 21:23:33' WHERE `id` = 3