app/controllers/developers_controller.rb

  def create
    logout_keeping_session!
    @developer = Developer.new(params[:developer])
    success = @developer && @developer.save
---
INSERT INTO `developers` (`name`, `salt`, `activated_at`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `remember_token`, `login`, `email`, `created_at`) VALUES('', '1a4cad32106bae72cc09495de318bac73e9be2b3', NULL, '2009-10-14 13:27:40', '911cfbda2b7e4dfeda14019166b47fd5999c79fd', NULL, '668028482ff20833c32019c189ba5336f645869c', NULL, 'jrath', 'jrath95@yahoo.co.in', '2009-10-14 13:27:40')