app/controllers/source_preferences_controller.rb

  def index
    @source_preferences = @app.source_preferences.group_by{|sp| sp.source_id}
---
SELECT * FROM `sources`

  def update_or_create
    @source_preference = @app.source_preferences.find_by_source_id(params[:id])
    unless @source_preference
      @source_preference = SourcePreference.new(:source_id => params[:id], :preference => params[:preference])
    end

    if (@source_preference.new_record? and @app.source_preferences << @source_preference) or
       (not @source_preference.new_record? and @source_preference.update_attributes({:preference => params[:preference]}))
---
INSERT INTO `app_source_preferences` (`app_id`, `source_preference_id`) VALUES(1, 1)
INSERT INTO `source_preferences` (`source_id`, `preference`) VALUES(1, 2)
UPDATE `source_preferences` SET `preference` = 1 WHERE `id` = 3

  def find_app
    @app_id = params[:app_id]
    unless @app_id
      redirect_to apps_url
      return
    end
    @app = @current_developer.apps.find_by_id(@app_id)
---
SELECT `apps`.* FROM `apps` INNER JOIN `app_developers` ON `apps`.id = `app_developers`.app_id WHERE (`apps`.`id` = '1') AND ((`app_developers`.developer_id = 1)) LIMIT 1